{
   "class_name": "Model", 
   "keras_version": "1.2.1", 
   "config": {
      "layers": [
         {
            "class_name": "InputLayer", 
            "inbound_nodes": [], 
            "config": {
               "batch_input_shape": [
                  null, 
                  1, 
                  33, 
                  33, 
                  33
               ], 
               "sparse": false, 
               "input_dtype": "float32", 
               "name": "input_1"
            }, 
            "name": "input_1"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "input_1", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_1", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "th", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 16, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_1"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_1", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_2", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "th", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 16, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_2"
         }, 
         {
            "class_name": "MaxPooling3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_2", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "name": "maxpooling3d_1", 
               "trainable": true, 
               "dim_ordering": "th", 
               "pool_size": [
                  2, 
                  2, 
                  2
               ], 
               "strides": [
                  2, 
                  2, 
                  2
               ], 
               "border_mode": "valid"
            }, 
            "name": "maxpooling3d_1"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "maxpooling3d_1", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_3", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "th", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 32, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_3"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_3", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_4", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "th", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 32, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_4"
         }, 
         {
            "class_name": "MaxPooling3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_4", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "name": "maxpooling3d_2", 
               "trainable": true, 
               "dim_ordering": "th", 
               "pool_size": [
                  2, 
                  2, 
                  2
               ], 
               "strides": [
                  2, 
                  2, 
                  2
               ], 
               "border_mode": "valid"
            }, 
            "name": "maxpooling3d_2"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "maxpooling3d_2", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_5", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "th", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 64, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_5"
         }, 
         {
            "class_name": "Convolution3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_5", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "b_constraint": null, 
               "name": "convolution3d_6", 
               "subsample": [
                  1, 
                  1, 
                  1
               ], 
               "activation": "relu", 
               "W_constraint": null, 
               "init": "glorot_uniform", 
               "dim_ordering": "th", 
               "kernel_dim3": 3, 
               "kernel_dim2": 3, 
               "kernel_dim1": 3, 
               "bias": true, 
               "nb_filter": 64, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activity_regularizer": null, 
               "border_mode": "same"
            }, 
            "name": "convolution3d_6"
         }, 
         {
            "class_name": "MaxPooling3D", 
            "inbound_nodes": [
               [
                  [
                     "convolution3d_6", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "name": "maxpooling3d_3", 
               "trainable": true, 
               "dim_ordering": "th", 
               "pool_size": [
                  2, 
                  2, 
                  2
               ], 
               "strides": [
                  2, 
                  2, 
                  2
               ], 
               "border_mode": "valid"
            }, 
            "name": "maxpooling3d_3"
         }, 
         {
            "class_name": "Flatten", 
            "inbound_nodes": [
               [
                  [
                     "maxpooling3d_3", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "trainable": true, 
               "name": "flatten_1"
            }, 
            "name": "flatten_1"
         }, 
         {
            "class_name": "Dense", 
            "inbound_nodes": [
               [
                  [
                     "flatten_1", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "W_constraint": null, 
               "b_constraint": null, 
               "name": "dense_1", 
               "activity_regularizer": null, 
               "trainable": true, 
               "init": "glorot_uniform", 
               "bias": true, 
               "input_dim": 4096, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activation": "relu", 
               "output_dim": 128
            }, 
            "name": "dense_1"
         }, 
         {
            "class_name": "Dense", 
            "inbound_nodes": [
               [
                  [
                     "dense_1", 
                     0, 
                     0
                  ]
               ]
            ], 
            "config": {
               "W_constraint": null, 
               "b_constraint": null, 
               "name": "dense_2", 
               "activity_regularizer": null, 
               "trainable": true, 
               "init": "glorot_uniform", 
               "bias": true, 
               "input_dim": 128, 
               "b_regularizer": null, 
               "W_regularizer": null, 
               "activation": "softmax", 
               "output_dim": 2
            }, 
            "name": "dense_2"
         }
      ], 
      "input_layers": [
         [
            "input_1", 
            0, 
            0
         ]
      ], 
      "name": "model_1", 
      "output_layers": [
         [
            "dense_2", 
            0, 
            0
         ]
      ]
   }
}